{
    "spells":{
        "Acid_Splash":{
                "name":"Acid Splash",
                "school":"Conjuration",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"60ft",
                "duration":"Instantaneous",
                "attsv":"DEX save",
                "effect":"acid",
                "description":"You hurl a bubble of acid. Choose one or two creatures you can see within range. If you choose two, they must be within 5 feet of each other. A target must succeed on a Dexterity saving throw or take 1d6 acid damage.\nThis spell’s damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).",
                "lvl":0,
                "clases":["sorcerer","wizard","artificer"]
            },
        "Chill Touch":{
                "name":"Chill Touch",
                "school":"Necromancy",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"120ft",
                "duration":"1 Round",
                "attsv":"Ranged",
                "effect":"Necrotic",
                "description":"You create a ghostly, skeletal hand in the space of a creature within range. Make a ranged spell attack against the creature to assail it with the chill of the grave. On a hit, the target takes 1d8 necrotic damage, and it can't regain hit points until the start of your next turn. Until then, the hand clings to the target.\nIf you hit an undead target, it also has disadvantage on attack rolls against you until the end of your next turn.\nThis spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
                "lvl":0,
                "clases":["sorcerer","wizard","artificer"]
            },
        "Dancing Lights":{
                "name":"Dancing Lights",
                "school":"Evocation",
                "components":["V","S","M"],
                "castingtime":"1 Action",
                "range":"120ft",
                "duration":"1 Minute",
                "attsv":"None",
                "effect":"Utility",
                "description":"You create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration. You can also combine the four lights into one glowing vaguely humanoid form of Medium size. Whichever form you choose, each light sheds dim light in a 10-foot radius.\nAs a bonus action on your turn, you can move the lights up to 60 feet to a new spot within range. A light must be within 20 feet of another light created by this spell, and a light winks out if it exceeds the spell's range.",
                "material":"a bit of phosphorus or wychwood, or a glowworm",
                "lvl":0,
                "clases":["bard","sorcerer","wizard","artificer"]
            },
        "druidcraft":{
                "name":"druidcraft",
                "school":"Transmutation",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"30ft",
                "duration":"Instantaneous",
                "attsv":"None",
                "effect":"Control",
                "description":"Whispering to the spirits of nature, you create one of the following effects within range:\nYou create a tiny, harmless sensory effect that predicts what the weather will be at your location for the next 24 hours. The effect might manifest as a golden orb for clear skies, a cloud for rain, falling snowflakes for snow, and so on. This effect persists for 1 round.\nYou instantly make a flower blossom, a seed pod open, or a leaf bud bloom.\nYou create an instantaneous, harmless sensory effect, such as falling leaves, a puff of wind, the sound of a small animal, or the faint odor of skunk. The effect must fit in a 5-foot cube.\nYou instantly light or snuff out a candle, a torch, or a small campfire.",
                "lvl":0,
                "clases":["druid"]
            },
        "Eldritch_Blast":{
                "name":"Eldritch Blast",
                "school":"Evocation",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"120ft",
                "duration":"Instantaneous",
                "attsv":"Ranged",
                "effect":"Force",
                "description":"A beam of crackling energy streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 force damage.\nThe spell creates more than one beam when you reach higher levels: two beams at 5th level, three beams at 11th level, and four beams at 17th level. You can direct the beams at the same target or at different ones. Make a separate attack roll for each beam.",
                "lvl":0,
                "clases":["warlock"]
            },
        "Fire_Bolt":{
                "name":"Fire Bolt",
                "school":"Evocation",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"120ft",
                "duration":"Instantaneous",
                "attsv":"Ranged",
                "effect":"Fire",
                "description":"You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn't being worn or carried.\nThis spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
                "lvl":0,
                "clases":["sorcerer","wizard","artificer"]
            },
        "Guidance":{
                "name":"Guidance",
                "school":"Divination",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"Touch",
                "duration":"1 Minute",
                "attsv":"None",
                "effect":"Buff",
                "description":"You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends.",
                "lvl":0,
                "clases":["cleric","druid","artificer"]
            },
        "Light":{
                "name":"Light",
                "school":"Evocation",
                "components":["V","M"],
                "castingtime":"1 Action",
                "range":"Touch (20ft)",
                "duration":"1 Hour",
                "attsv":"DEX Save",
                "effect":"Creation",
                "description":"You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action.\nIf you target an object held or worn by a hostile creature, that creature must succeed on a Dexterity saving throw to avoid the spell.",
                "material":"a firefly or phosphorescent moss",
                "lvl":0,
                "clases":["bard","cleric","sorcerer","wizard","artificer"]
            },
        "Mage_Hand":{
                "name":"Mage Hand",
                "school":"Conjuration",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"30ft",
                "duration":"1 Minute",
                "attsv":"None",
                "effect":"Utility",
                "description":"A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.\nYou can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it.\nThe hand can't attack, activate magic items, or carry more than 10 pounds.",
                "lvl":0,
                "clases":["bard","sorcerer","warlock","wizard","artificer"]
            },
        "Mending":{
                "name":"Mending",
                "school":"Transmutation",
                "components":["V","S","M"],
                "castingtime":"1 Minute",
                "range":"Touch",
                "duration":"Instantaneous",
                "attsv":"None",
                "effect":"Utility",
                "description":"This spell repairs a single break or tear in an object you touch, such as a broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage.\nThis spell can physically repair a magic item or construct, but the spell can't restore magic to such an object.",
                "material":"two lodestones",
                "lvl":0,
                "clases":["bard","cleric","druid","sorcerer","wizard","artificer"]
            },
        "Alarm":{
                "name":"Alarm",
                "school":"Abjuration",
                "components":["V","S","M"],
                "castingtime":"1 Minute",
                "range":"30ft",
                "duration":"8 Hours",
                "attsv":"None",
                "effect":"Detection",
                "description":"You set an alarm against unwanted intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot cube. Until the spell ends, an alarm alerts you whenever a Tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won't set off the alarm. You also choose whether the alarm is mental or audible.\nA mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area. This ping awakens you if you are sleeping.\nAn audible alarm produces the sound of a hand bell for 10 seconds within 60 feet.",
                "material":"a tiny bell and a piece of fine silver wire",
                "lvl":1,
                "clases":["ranger","wizard","artificer"]
            },
        "Animal_Friendship":{
                "name":"Animal Friendship",
                "school":"Enchantment",
                "components":["V","S","M"],
                "castingtime":"1 Action",
                "range":"30ft",
                "duration":"24 Hours",
                "attsv":"WIS Save",
                "effect":"Charmed",
                "description":"This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell's duration. If you or one of your companions harms the target, the spell ends.\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional beast for each slot level above 1st.",
                "material":"a morsel of food",
                "lvl":1,
                "clases":["bard","druid","ranger"]
            },
        "Bane":{
                "name":"Bane",
                "school":"Enchantment",
                "components":["V","S","M"],
                "castingtime":"1 Action",
                "range":"30ft",
                "duration":"1 Minute",
                "attsv":"CHA Save",
                "effect":"Debuff",
                "description":"Up to three creatures of your choice that you can see within range must make Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw.\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st.",
                "material":"a drop of blood",
                "lvl":1,
                "clases":["bard","cleric"]
            },
        "Bless":{
                "name":"Bless",
                "school":"Enchantment",
                "components":["V","S","M"],
                "castingtime":"1 Action",
                "range":"30ft",
                "duration":"1 Minute",
                "attsv":"None",
                "effect":"Buff",
                "description":"You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll a d4 and add the number rolled to the attack roll or saving throw.\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st.",
                "material":"a sprinkling of holy water",
                "lvl":1,
                "clases":["cleric","paladin"]
            },
        "Burning_hand":{
                "name":"Burning hand",
                "school":"Evocation",
                "components":["V","S"],
                "castingtime":"Instantaneous",
                "range":"Self (15 ft)",
                "duration":"1 Minute",
                "attsv":"DEX Save",
                "effect":"Fire",
                "description":"As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one.\nThe fire ignites any flammable objects in the area that aren't being worn or carried.\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.",
                "lvl":1,
                "clases":["bard","sorcerer","wizard","artificer"]
            },
        "Charm_Person":{
                "name":"Charm Person",
                "school":"Enchantment",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"30 ft",
                "duration":"1 Hour",
                "attsv":"WIS Save",
                "effect":"Charmed",
                "description":"You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you.\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
                "lvl":1,
                "clases":["bard","druid","sorcerer","warlock","wizard"]
            },
        "Color_Spray":{
                "name":"Color Spray",
                "school":"Illusion",
                "components":["V","S","M"],
                "castingtime":"1 Action",
                "range":"Self (15 ft)",
                "duration":"1 Round",
                "attsv":"None",
                "effect":"Blinded",
                "description":"A dazzling array of flashing, colored light springs from your hand. Roll 6d10; the total is how many hit points of creatures this spell can affect. Creatures in a 15-foot cone originating from you are affected in ascending order of their current hit points (ignoring unconscious creatures and creatures that can't see).\nStarting with the creature that has the lowest current hit points, each creature affected by this spell is blinded until the end of your next turn. Subtract each creature's hit points from the total before moving on to the creature with the next lowest hit points. A creature's hit points must be equal to or less than the remaining total for that creature to be affected.\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d10 for each slot level above 1st.",
                "material":"a pinch of powder or sand that is colored red, yellow, and blue",
                "lvl":1,
                "clases":["sorcerer","wizard"]
            },
        "Command":{
                "name":"Command",
                "school":"Enchantment",
                "components":["V"],
                "castingtime":"1 Action",
                "range":"60 ft",
                "duration":"1 Round",
                "attsv":"WIS Save",
                "effect":"Prone",
                "description":"You speak a one-word command to a creature you can see within range. The target must succeed on a Wisdom saving throw or follow the command on its next turn. The spell has no effect if the target is undead, if it doesn't understand your language, or if your command is directly harmful to it.\nSome typical commands and their effects follow. You might issue a command other than one described here. If you do so, the GM determines how the target behaves. If the target can't follow your command, the spell ends.\nApproach. The target moves toward you by the shortest and most direct route, ending its turn if it moves within 5 feet of you.\nDrop. The target drops whatever it is holding and then ends its turn.\nFlee. The target spends its turn moving away from you by the fastest available means.\nGrovel. The target falls prone and then ends its turn.\nHalt. The target doesn't move and takes no actions. A flying creature stays aloft, provided that it is able to do so. If it must move to stay aloft, it flies the minimum distance needed to remain in the air.\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
                "lvl":1,
                "clases":["cleric","paladin"]
            },
        "Cure_Wounds":{
                "name":"Cure Wounds",
                "school":"Evocation",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"Touch",
                "duration":"Instantaneous",
                "attsv":"None",
                "effect":"Healing",
                "description":"A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs.\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st.",
                "lvl":1,
                "clases":["bard","cleric","druid","paladin","ranger","artificer"]
            },
        "Detect_Magic":{
                "name":"Detect Magic",
                "school":"Divination",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"Self (30 ft)",
                "duration":"10 Minutes",
                "attsv":"None",
                "effect":"Detection",
                "description":"For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.\nThe spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.",
                "lvl":1,
                "clases":["bard","cleric","druid","paladin","ranger","sorcerer","wizard","artificer"]
            },
        "Alter_Self":{
                "name":"Alter Self",
                "school":"Transmutation",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"Self",
                "duration":"1 Hour",
                "attsv":"None",
                "effect":"Shapechanging",
                "description":"You assume a different form. When you cast the spell, choose one of the following options, the effects of which last for the duration of the spell. While the spell lasts, you can end one option as an action to gain the benefits of a different one.\nAquatic Adaptation. You adapt your body to an aquatic environment, sprouting gills and growing webbing between your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed.\nChange Appearance. You transform your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair length, coloration, and distinguishing characteristics, if any. You can make yourself appear as a member of another race, though none of your statistics change. You also can't appear as a creature of a different size than you, and your basic shape stays the same; if you're bipedal, you can't use this spell to become quadrupedal, for instance. At any time for the duration of the spell, you can use your action to change your appearance in this way again.\nNatural Weapons. You grow claws, fangs, spines, horns, or a different natural weapon of your choice. Your unarmed strikes deal 1d6 bludgeoning, piercing, or slashing damage, as appropriate to the natural weapon you chose, and you are proficient with your unarmed strikes. Finally, the natural weapon is magic and you have a +1 bonus to the attack and damage rolls you make using it.",
                "lvl":2,
                "clases":["sorcerer","wizard","artificer"]
            },
        "Blindness_Deafness":{
                "name":"Blindness Deafness",
                "school":"Necromancy",
                "components":["V"],
                "castingtime":"1 Action",
                "range":"30",
                "duration":"1 Minutes",
                "attsv":"CON Save",
                "effect":"Blinded",
                "description":"You can blind or deafen a foe. Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a success, the spell ends.\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.",
                "lvl":2,
                "clases":["bard","cleric","sorcerer","wizard"]
            },
        "Calm_Emotions":{
                "name":"Calm Emotions",
                "school":"Enchantment",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"60 ft (20 ft)",
                "duration":"1 Action",
                "attsv":"CHA Save",
                "effect":"Charmed",
                "description":"You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a Charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, choose one of the following two effects.\nYou can suppress any effect causing a target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime.\nAlternatively, you can make a target indifferent about creatures of your choice that it is hostile toward. This indifference ends if the target is attacked or harmed by a spell or if it witnesses any of its friends being harmed. When the spell ends, the creature becomes hostile again, unless the DM rules otherwise."            ,
                "lvl":2,
                "clases":["bard","cleric"]
            },
        "Find_Traps":{
                "name":"Find Traps",
                "school":"Divination",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"Self (30 ft)",
                "duration":"Instantaneous",
                "attsv":"None",
                "effect":"Detection",
                "description":"You sense the presence of any trap within range that is within line of sight. A trap, for the purpose of this spell, includes anything that would inflict a sudden or unexpected effect you consider harmful or undesirable, which was specifically intended as such by its creator. Thus, the spell would sense an area affected by the alarm spell, a glyph of warding, or a mechanical pit trap, but it would not reveal a natural weakness in the floor, an unstable ceiling, or a hidden sinkhole.\nThis spell merely reveals that a trap is present. You don't learn the location of each trap, but you do learn the general nature of the danger posed by a trap you sense."            ,
                "lvl":2,
                "clases":["cleric","druid","ranger"]
            },
        "Lesser_Restoration":{
                "name":"Lesser Restoration",
                "school":"Abjuration",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"Touch",
                "duration":"Instantaneous",
                "attsv":"None",
                "effect":"Healing",
                "description":"You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned.",
                "lvl":2,
                "clases":["bard","cleric","druid","paladin","ranger","artificer"]      
            },
        "Magic_Weapon":{
                "name":"Magic Weapon",
                "school":"Transmutation",
                "components":["V","S"],
                "castingtime":"1 Bonus Action",
                "range":"Touch",
                "duration":"1 Hour",
                "attsv":"None",
                "effect":"Bludgeoning",
                "description":"You touch a nonmagical weapon. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls.\nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the bonus increases to +2. When you use a spell slot of 6th level or higher, the bonus increases to +3."            ,
                "lvl":2,
                "clases":["paladin","wizard","artificer"]
            },
        "Ray_of_Enfeeblement":{
                "name":"Ray of Enfeeblement",
                "school":"Necromancy",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"60 ft",
                "duration":"1 Minutes",
                "attsv":"CON Save",
                "effect":"Debuff",
                "description":"A black beam of enervating energy springs from your finger toward a creature within range. Make a ranged spell attack against the target. On a hit, the target deals only half damage with weapon attacks that use Strength until the spell ends.\nA black beam of enervating energy springs from your finger toward a creature within range. Make a ranged spell attack against the target. On a hit, the target deals only half damage with weapon attacks that use Strength until the spell ends."            ,
                "lvl":2,
                "clases":["warlock","wizard"]
            },
        "Silence":{
                "name":"Silence",
                "school":"Illusion",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"120 ft (30 ft)",
                "duration":"10 Minutes",
                "attsv":"None",
                "effect":"Control",
                "description":"For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there."            ,
                "lvl":2,
                "clases":["bard","cleric","ranger"]
            },
        "Spiritual_Weapon":{
                "name":"Spiritual Weapon",
                "school":"Evocation",
                "components":["V","S"],
                "castingtime":"1 Bonus Action",
                "range":"60 ft",
                "duration":"1 Minute",
                "attsv":"Melee",
                "effect":"Force",
                "description":"You create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier.\nYou create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier.\nYou create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier.\nYou create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier."            ,
                "lvl":2,
                "clases":["cleric"]
            },
        "Zone_of_Truth":{
                "name":"Zone of Truth",
                "school":"Enchantment",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"60 ft (15 ft)",
                "duration":"10 Minutes",
                "attsv":"CHA Save",
                "effect":"Control",
                "description":"You create a magical zone that guards against deception in a 15-foot-radius sphere centered on a point of your choice within range. Until the spell ends, a creature that enters the spell's area for the first time on a turn or starts its turn there must make a Charisma saving throw. On a failed save, a creature can't speak a deliberate lie while in the radius. You know whether each creature succeeds or fails on its saving throw.\nYou create a magical zone that guards against deception in a 15-foot-radius sphere centered on a point of your choice within range. Until the spell ends, a creature that enters the spell's area for the first time on a turn or starts its turn there must make a Charisma saving throw. On a failed save, a creature can't speak a deliberate lie while in the radius. You know whether each creature succeeds or fails on its saving throw."            ,
                "lvl":2,
                "clases":["bard","cleric","paladin"]
            },
        "Beacon_of_Hope":{
                "name":"Beacon of Hope",
                "school":"Abjuration",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"30 ft",
                "duration":"1 Minute",
                "attsv":"None",
                "effect":"Buff",
                "description":"This spell bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on Wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing.",
                "lvl":3,
                "clases":["cleric"]
            },
        "Bestow_Curse":{
                "name":"Bestow Curse",
                "school":"Necromancy",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"Touch",
                "duration":"1 Minute",
                "attsv":"WIS Save",
                "effect":"Debuff",
                "description":"You touch a creature, and that creature must succeed on a Wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options:\nChoose one ability score. While cursed, the target has disadvantage on ability checks and saving throws made with that ability score.\nWhile cursed, the target has disadvantage on attack rolls against you.\nWhile cursed, the target must make a Wisdom saving throw at the start of each of its turns. If it fails, it wastes its action that turn doing nothing.\nWhile the target is cursed, your attacks and spells deal an extra 1d8 necrotic damage to the target.\nA remove curse spell ends this effect. At the DM's option, you may choose an alternative curse effect, but it should be no more powerful than those described above. The DM has final say on such a curse's effect.\nAt Higher Levels. If you cast this spell using a spell slot of 4th level or higher, the duration is concentration, up to 10 minutes. If you use a spell slot of 5th level or higher, the duration is 8 hours. If you use a spell slot of 7th level or higher, the duration is 24 hours. If you use a 9th level spell slot, the spell lasts until it is dispelled. Using a spell slot of 5th level or higher grants a duration that doesn't require concentration.",
                "lvl":3,
                "clases":["bard","cleric","wizard"]
            },
        "Counterspell":{
                "name":"Counterspell",
                "school":"Abjuration",
                "components":["S"],
                "castingtime":"1 Reaction",
                "range":"60 ft",
                "duration":"Instantaneous",
                "attsv":"None",
                "effect":"Negation",
                "description":"You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a success, the creature's spell fails and has no effect.\nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used.",
                "lvl":3,
                "clases":["sorcerer","warlock","wizard"]
            },
        "Blink":{
                "name":"Blink",
                "school":"Transmutation",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"Self",
                "duration":"1 Minute",
                "attsv":"None",
                "effect":"Utility",
                "description":"Roll a d20 at the end of each of your turns for the duration of the spell. On a roll of 11 or higher, you vanish from your current plane of existence and appear in the Ethereal Plane (the spell fails and the casting is wasted if you were already on that plane). At the start of your next turn, and when the spell ends if you are on the Ethereal Plane, you return to an unoccupied space of your choice that you can see within 10 feet of the space you vanished from. If no unoccupied space is available within that range, you appear in the nearest unoccupied space (chosen at random if more than one space is equally near). You can dismiss this spell as an action.\nWhile on the Ethereal Plane, you can see and hear the plane you originated from, which is cast in shades of gray, and you can't see anything there more than 60 feet away. You can only affect and be affected by other creatures on the Ethereal Plane. Creatures that aren't there can't perceive you or interact with you, unless they have the ability to do so.",
                "lvl":3,
                "clases":["sorcerer","wizard","artificer"]
            },
        "Dispel_Magic":{
                "name":"Dispel Magic",
                "school":"Abjuration",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"120 ft",
                "duration":"Instantaneous",
                "attsv":"None",
                "effect":"Control",
                "description":"Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends.\nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, you automatically end the effects of a spell on the target if the spell's level is equal to or less than the level of the spell slot you used.",
                "lvl":3,
                "clases":["bard","cleric","druid","paladin","sorcerer","warlock","wizard","artificer"]
            },
        "Mass_Healing_Word":{
                "name":"Mass Healing Word",
                "school":"Evocation",
                "components":["V"],
                "castingtime":"1 Bonus Action",
                "range":"60 ft",
                "duration":"Instantaneous",
                "attsv":"None",
                "effect":"Healing",
                "description":"As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs.\nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the healing increases by 1d4 for each slot level above 3rd.",
                "lvl":3,
                "clases":["cleric"]
            },
        "Zone_of_Truth1":{
                "school":"Enchantment",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"60 ft (15 ft)",
                "duration":"10 Minutes",
                "attsv":"CHA Save",
                "effect":"Control",
                "description":"",
                "lvl":3
            },
        "Zone_of_Truth2":{
                "school":"Enchantment",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"60 ft (15 ft)",
                "duration":"10 Minutes",
                "attsv":"CHA Save",
                "effect":"Control",
                "description":"",
                "lvl":3
            },
        "Zone_of_Truth3":{
                "school":"Enchantment",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"60 ft (15 ft)",
                "duration":"10 Minutes",
                "attsv":"CHA Save",
                "effect":"Control",
                "description":"",
                "lvl":3
            },
        "Zone_of_Truth4":{
                "school":"Enchantment",
                "components":["V","S"],
                "castingtime":"1 Action",
                "range":"60 ft (15 ft)",
                "duration":"10 Minutes",
                "attsv":"CHA Save",
                "effect":"Control",
                "description":"",
                "lvl":3
            },
            
        "four":{

        },
        "five":{

        },
        "six":{

        },
        "seven":{

        },
        "eight":{

        },
        "nine":{

        }
        

    }
}